---
Description: Recipe description
Identifier: com.github.w0de.download.colima
MinimumVersion: "0.4.4"
Input:
  NAME: colima
  ARCHITECTURE: arm64
Process:
  - Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/pkg"
      pkgdirs:
        usr/local/bin: "777"
        Library/LaunchAgents: "777"
        Library/Colima/scripts: "777"
    Processor: PkgRootCreator
  - Arguments:
      asset_regex: colima-Darwin-%ARCHITECTURE%
      github_repo: abiosoft/colima
    Processor: GitHubReleasesInfoProvider
  - Arguments:
      url: "%asset_url%"
      request_headers:
        Accept: application/octet-stream
    Processor: URLDownloader
  - Arguments:
      source_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/pkg/usr/local/bin/colima"
      overwrite: true
    Processor: Copier
  - Arguments:
      pkg_request:
        pkgroot: "%RECIPE_CACHE_DIR%/pkg"
        pkgdir: "%RECIPE_CACHE_DIR%"
        pkgname: "colima-%ARCHITECTURE%-%version%"
        pkgtype: flat
        id: com.github.abiosoft.colima
        version: "%version%"
        scripts: "%RECIPE_CACHE_DIR%/pkg/Library/Colima/scripts"
        chown:
          - path: usr/local/bin
            user: root
            group: wheel
            mode: "755"
          - path: usr/local/bin/colima
            user: root
            group: wheel
            mode: "755"
    Processor: PkgCreator
