---
Description: Recipe description
Identifier: com.github.w0de.download.colima
MinimumVersion: "0.4.4"
Input:
  NAME: colima
  ARCHITECTURE: arm64
Process:
  - Arguments:
      asset_regex: colima-Darwin-%ARCHITECTURE%
      github_repo: abiosoft/colima
    Processor: GitHubReleasesInfoProvider
  - Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/pkg"
      pkgdirs:
        usr/local/bin: "777"
        Library/LaunchAgents: "777"
        Library/Colima/scripts: "777"
    Processor: PkgRootCreator
  - Arguments:
      url: "%asset_url%"
      filename: "colima"
      download_dir: "%RECIPE_CACHE_DIR%/pkg/usr/local/bin"
    Processor: URLDownloader
  - Arguments:
      file_path: "%RECIPE_CACHE_DIR%/pkg/Library/LaunchAgents/com.github.abiosoft.colima.plist"
      file_mode: "644"
      file_content: |
        <?xml version="1.0" encoding="UTF-8"?>
        <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
        <plist version="1.0">
          <dict>
            <key>Label</key>
            <string>com.github.abiosoft.colima</string>
            <key>Program</key>
            <string>/usr/local/bin/colima</string>
            <key>RunAtLoad</key>
            <true/>
            <key>KeepAlive</key>
            <false/>
          </dict>
        </plist>
    Processor: FileCreator
  - Arguments:
      file_path: "%RECIPE_CACHE_DIR%/pkg/Library/Colima/scripts/postinstall"
      file_mode: "755"
      file_content: |
        #!/bin/zsh
        /bin/launchctl load -w /Library/LaunchAgents/com.github.abiosoft.colima.plist
        exit 0
    Processor: FileCreator
  - Arguments:
      pkg_request:
        pkgroot: "%RECIPE_CACHE_DIR%/pkg"
        pkgdir: "%RECIPE_CACHE_DIR%"
        pkgname: "colima-Darwin-%ARCHITECTURE%-%version%"
        pkgtype: flat
        id: com.github.abiosoft.colima
        version: "%version%"
        scripts: "%RECIPE_CACHE_DIR%/pkg/Library/Colima/scripts"
        chown:
          - path: usr/local/bin
            user: root
            group: wheel
            mode: "755"
          - path: usr/local/bin/colima
            user: root
            group: wheel
            mode: "755"
          - path: Library
            user: root
            group: wheel
            mode: "755"
          - path: Library/Colima
            user: root
            group: wheel
            mode: "755"
          - path: Library/Colima/scripts
            user: root
            group: wheel
            mode: "755"
          - path: Library/Colima/scripts/postinstall
            user: root
            group: wheel
            mode: "755"
          - path: Library/LaunchAgents
            user: root
            group: wheel
            mode: "755"
          - path: Library/LaunchAgents/com.github.abiosoft.colima.plist
            user: root
            group: wheel
            mode: "644"
    Processor: PkgCreator
