---
Description: Recipe description
Identifier: com.github.w0de.munki.colima
MinimumVersion: "0.4.4"
Input:
  NAME: colima
  pkginfo:
    unattended_install: true
    display_name: Colima
    developer: Abiola Ibrahim
    supported_architectures:
      - "%ARCHITECTURE%"
    catalogs:
      - testing
    postuninstall_script: |
      #!/bin/zsh
      /bin/launchctl unload -w /Library/LaunchAgents/com.github.abiosoft.colima.plist
      exit 0
ParentRecipe: com.github.w0de.download.colima
Process:
  - Arguments:
      additional_pkginfo:
        description: "%release_notes%"
    Processor: MunkiPkginfoMerger
  - Arguments:
      repo_subdirectory: Development
      pkg_path: "%RECIPE_CACHE_DIR%/colima-%ARCHITECTURE%-%version%.pkg"
    Processor: MunkiImporter
