---
Description: Recipe description
Identifier: com.github.w0de.download.colima
MinimumVersion: "0.4.4"
Input:
  NAME: colima
  ARCHITECTURE: arm64
Process:
  - Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/pkg"
      pkgdirs:
        usr/local: "777"
        usr/local/lima: "777"
    Processor: PkgRootCreator
  - Arguments:
      asset_regex: "lima-[\\.\\d]*-Darwin-%ARCHITECTURE%.tar.gz"
      github_repo: lima-vm/lima
    Processor: GitHubReleasesInfoProvider
  - Arguments:
      url: "%asset_url%"
      request_headers:
        Accept: application/octet-stream
    Processor: URLDownloader
  - Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/pkg"
      purge_destination: false
      archive_format: tar_gzip
    Processor: Unarchiver
  - Arguments:
      source: "%RECIPE_CACHE_DIR%/pkg/share"
      target: "%RECIPE_CACHE_DIR%/pkg/usr/local/lima/share"
    Processor: FileMover
  - Arguments:
      source: "%RECIPE_CACHE_DIR%/pkg/bin"
      target: "%RECIPE_CACHE_DIR%/pkg/usr/local/bin"
    Processor: FileMover
  - Arguments:
      asset_regex: "colima-Darwin-%ARCHITECTURE%"
      github_repo: abiosoft/colima
    Processor: GitHubReleasesInfoProvider
  - Arguments:
      url: "%asset_url%"
      download_dir: "%RECIPE_CACHE_DIR%/pkg/usr/local/bin"
      filename: colima
      request_headers:
        Accept: application/octet-stream
    Processor: URLDownloader
  - Arguments:
      pkg_request:
        pkgroot: "%RECIPE_CACHE_DIR%/pkg"
        pkgdir: "%RECIPE_CACHE_DIR%"
        pkgname: "colima-%ARCHITECTURE%-%version%"
        pkgtype: flat
        id: com.github.abiosoft.colima
        version: "%version%"
        chown:
          - path: usr/local/bin
            user: root
            group: wheel
            mode: "755"
          - path: usr/local/bin/colima
            user: root
            group: wheel
            mode: "755"
          - path: usr/local/bin/lima
            user: root
            group: wheel
            mode: "755"
          - path: usr/local/lima
            user: root
            group: wheel
            mode: "755"
          - path: usr/local/lima/share
            user: root
            group: wheel
            mode: "755"
          - path: usr/local/lima/doc
            user: root
            group: wheel
            mode: "755"
    Processor: PkgCreator
