---
Description: Recipe description
Identifier: com.github.w0de.download.colima
MinimumVersion: "0.4.4"
Input:
  NAME: colima
  ARCHITECTURE: arm64
Process:
  - Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/colima-dmg"
    Processor: PkgRootCreator
  - Arguments:
      asset_regex: colima-Darwin-%ARCHITECTURE%
      github_repo: abiosoft/colima
    Processor: GitHubReleasesInfoProvider
  - Arguments:
      url: "%asset_url%"
      filename: "colima-Darwin-%ARCHITECTURE%-%version%"
      download_dir: "%RECIPE_CACHE_DIR%/colima-dmg"
    Processor: URLDownloader
  - Arguments:
      dmg_root: "%RECIPE_CACHE_DIR%/colima-dmg"
      dmg_path: "%RECIPE_CACHE_DIR%/colima-Darwin-%ARCHITECTURE%-%version%.dmg"
    Processor: DmgCreator
