<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>ParentRecipe</key>
    <string>com.github.w0de.download.AWSCLIv2</string>
    <key>Description</key>
    <string>AWSCLIv2</string>
    <key>Identifier</key>
    <string>com.github.w0de.munki.AWSCLIv2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AWSCLIv2</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Installs AWSCLI version 2.</string>
            <key>display_name</key>
            <string>AWSCLIv2</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>Process</key>
    <array>
        <dict>
          <key>Arguments</key>
          <dict>
            <key>pkg_path</key>
            <string>%pathname%</string>
            <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
          </dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
