<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of http://aws.amazon.com/cli/</string>
	<key>Identifier</key>
	<string>com.github.w0de.download.AWSCLIv2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AWSCLIv2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://awscli.amazonaws.com/AWSCLIV2.pkg</string>
				<key>filename</key>
				<string>AWSCLIV2.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
