<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Fluent Bit is a super fast, lightweight, and highly scalable logging and metrics processor and forwarder.</string>
	<key>Identifier</key>
	<string>com.github.w0de.download.fluent-bit-config</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>fluent-bit-config</string>
		<key>RELEASE_REPO</key>
		<string>Faire/it-cpe-fluentbit</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>.*\.pkg</string>
				<key>github_repo</key>
				<string>%RELEASE_REPO%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%asset_url%</string>
				<key>filename</key>
				<string>it-cpe-fluent-bit-config-v%version%.pkg</string>
				<key>request_headers</key>
				<dict>
					<key>Authorization</key>
					<string>token %GITHUB_TOKEN%</string>
					<key>Accept</key>
					<string>application/octet-stream</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
