<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Gusto's gdev command line utility.</string>
	<key>Identifier</key>
	<string>com.github.w0de.download.wardrobe</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>wardrobe</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%asset_url%</string>
				<key>filename</key>
				<string>Wardrobe-v%version%.zip</string>
				<key>request_headers</key>
				<dict>
					<key>Authorization</key>
					<string>token %GITHUB_TOKEN%</string>
					<key>Accept</key>
					<string>application/octet-stream</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict></dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
