<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
  <string>com.github.w0de.download.wardrobe</string>
	<key>Description</key>
	<string>Wardrobe</string>
	<key>Identifier</key>
	<string>com.github.w0de.munki.wardrobe</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>wardrobe</string>
		<key>pkginfo</key>
		<dict>
			<key>unattended_install</key>
			<true/>
			<key>display_name</key>
			<string>Wardrobe</string>
			<key>developer</key>
			<string>Lucas Marçal</string>
			<key>category</key>
			<string>Engineering</string>
			<key>catalogs</key>
			<array>
				<string>import</string>
			</array>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict></dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/wardrobe/Wardrobe.app/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>description</key>
					<string>Version %version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/wardrobe/Wardrobe.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>utilities</string>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
