<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ParentRecipe</key>
  <string>com.github.w0de.download.dictionary</string>
	<key>Description</key>
	<string>A custom dictionary.</string>
	<key>Identifier</key>
	<string>com.github.w0de.munki.dictionary</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>dictionary</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>unattended_install</key>
			<true/>
			<key>display_name</key>
			<string>a custom dictionary</string>
			<key>developer</key>
			<string>a bibliophile</string>
			<key>category</key>
			<string>Utilities</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>preinstall_script</key>
			<string>#!/bin/zsh
if ! test -d /Library/Dictionaries; then
  mkdir /Library/Dictionaries
fi
			</string>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>description</key>
					<string>%release_notes%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--item="%DICTIONARY_PATH%"</string>
					<string>--destinationpath="/Library/Dictionaries"</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
