<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Gusto's gdev command line utility.</string>
	<key>Identifier</key>
	<string>com.github.w0de.download.gdev</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>gdev</string>
		<key>pkginfo</key>
		<dict>
			<key>unattended_install</key>
			<true/>
			<key>display_name</key>
			<string>gdev</string>
			<key>developer</key>
			<string>Ethan Hall</string>
			<key>category</key>
			<string>Engineering</string>
			<key>catalogs</key>
			<array>
				<string>import</string>
			</array>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>.*\.pkg</string>
				<key>github_repo</key>
				<string>gusto/gdev</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>prefetch_filename</key>
				<string>True</string>
				<key>url</key>
				<string>%asset_url%</string>
				<key>request_headers</key>
				<dict>
					<key>Authorization</key>
					<string>token %GITHUB_TOKEN%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
